Revit 2027 API
ThermalMaterialType Enumeration
 Represents the thermal material type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ThermalMaterialType
Public Enumeration ThermalMaterialType
public enum class ThermalMaterialType
type ThermalMaterialType
Members
Member name | Value | Description
Gas | 1 |  Thermal material type is gas.
Liquid | 2 |  Thermal material type is liquid.
Solid | 3 |  Thermal material type is solid.
Undefined | 0 |  Thermal material type is undefined.
See Also
Reference
Autodesk.Revit.DB Namespace